In [1]:
import pandas as pd

In [3]:
data = {
    "홍길동":[88,75,95],
    "강감찬":[82,62,85],
    "김종민":[75,69,70],
    "임창정":[45,56,80]
}
df = pd.DataFrame(data, index=['java','python','basic'])
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   80

In [4]:
# 홍길동 학생의 과목별 점수를 출력하시오

df["홍길동"]

java      88
python    75
basic     95
Name: 홍길동, dtype: int64

In [5]:
# python 과목의 점수를 출력하시오.

df.loc["python"]

홍길동    75
강감찬    62
김종민    69
임창정    56
Name: python, dtype: int64

In [8]:
# 임창정 학생의 basic 점수를 78로 수정하시오.

df.loc["basic","임창정"] = 78   # df.iloc[2,3] = 80
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78

In [9]:
# 각 학생의 sql 점수를 추가하시오 [70,85,86,92]

df.loc["sql"] = [70,85,86,92]
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78
sql      70   85   86   92

In [11]:
# basic 점수를 삭제하시오

df.drop("basic",inplace=True)
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
sql      70   85   86   92